---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.InvalidCompoundStructure
source: html/a186774e-c91a-7304-6cde-f1b5bedc202a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.InvalidCompoundStructure Property

Invalid compound structure.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidCompoundStructure { get; }
```